Repository: 84000/data-translation-memory
Catalog: toh93-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་དྲང་སྲོང་རྒྱས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: The Noble Mahāyāna Sūtra The Seer Vyāsa’s Questions Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་འགྲམ་རྒལ་བར་བྱ་བ་མ་ཡིན་པ། ཁུ་བྱུག་དང་། ནེ་ཙོ་དང་། བུང་བ་དང་། ངང་པའི་རྒྱལ་པོ་དང་། བྱའི་ཚོགས་དུ་མ་སྒྲ་སྙན་པ་འབྱིན་པ།
en: The Blessed One was on a bank of the Ganges River at a point where the river cannot be crossed and where the cuckoos, parrots, bees, regal geese, and many flocks of birds sing their lovely songs.

source: ཤིང་པླག་ཤ་དང་། ནྱ་གྲོ་དྷ་དང་། ཙན་དན་དང་། མྱ་ངན་འཚང་དང་། ས་ལ་ཀིའི་ཡལ་གས་བསྐྱབས་པ།
en: He was sheltered there by the branches of holy fig, banyan, sandalwood, aśoka, and sallakī trees, and the entire place was strewn with fragrant flowers.

source: རྟག་ཏུ་མེ་ཏོག་དྲི་ཞིམ་པོ་སིལ་མར་བཀྲམ་པ་དེ་ན་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ། ཟག་པ་ཟད་པ། རྡུལ་ཟད་པ། ཆོས་ལས་མི་ཟློགས་པ། བསམ་གཏན་དང་ཁ་ཏོན་ལ་གནས་པ། འཆག་ས་དང་ཁྲིའི་སྟེང་ན་འདུག་ན་ངང་པའི་རྒྱལ་པོ་ལྟར་ས་ཕྱོགས་དེ་མཛེས་པར་བྱེད་པ་ཤ་སྟག་ལ།
en: He sat there with a great assembly of monks, all of whom had accomplished their task, completed their work, exhausted their outflows, and shaken off the last remnants of dust, could never revert from the Dharma, were established in both meditation and recitation, and beautified the area like regal geese wherever they were—whether on walking paths or seated.

source: ཁ་ཅིག་ནི་ནང་དུ་ཡང་དག་འཇོག་ལ་གནས་པ། ཁ་ཅིག་ནི་ཤིང་དྲུང་ན་གནས་པ། དེ་བཞིན་གཤེགས་པའི་བཀའ་ཀུན་བགྲོ་བར་བྱེད་པ། ཆ་བྱད་དུལ་ཞིང་བརྟན་པ། སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ། འདོད་པ་ལ་འདོད་པ་དང་། གནོད་སེམས་དང་། སྙོམ་པ་དང་། གཉིད་དང་། ལེ་ལོ་དང་བྲལ་བ་ཤ་སྟག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: Some of them lived in seclusion, some of them dwelled at the foot of trees, and all of them discussed the word of the Tathāgata. Their appearance was subdued and steadfast, their deportment was tranquil, and all were free from sexual desire, harmful intentions, indolence, sloth, and laziness.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྦྱིན་པ་བྱིན་ཅིག །
en: The Blessed One said to the monks, “Monks, you must give gifts.

source: བྱ་བ་གང་ཡིན་པ་གྱིས་ཤིག །
en: You must do whatever is necessary.

source: ཚུལ་ཁྲིམས་ཀྱི་སྡོམ་པས་བསྡམས་ཤིང་དབང་པོ་སྦས་ལ་ཡིད་ཞི་བར་གནས་པར་གྱིས་ཤིག །
en: Exercise restraint using the vow of ethical conduct and dwell in that peaceful mental state where the sense faculties are guarded.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་རབ་ཏུ་མང་པོ་ལ་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། འོད་སྲུང་ཆེན་པོ་དང་། ཤཱ་རིའི་བུ་དང་། བཀྐུ་ལ་དང་། ནམ་གྲུ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་དི་ནྱ་དང་། དེ་དག་ལ་སོགས་པ་ཉན་ཐོས་ཆེན་པོ་ཤ་སྟག་དང་ཐབས་ཅིག་སྟེ། ཡང་དག་པར་དགའ་བ་དང་། ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་གཏམ་མཛད་དོ།
en: Then the Blessed One gave a teaching to that large number of monks as well as his most important disciples, such as the venerables Ānanda, Mahākāśyapa, Śāriputra, Bakkula, Revata, and the venerable Ājñātakauṇḍinya, that gladdened and delighted them.

source: །དེའི་ཚེ་ནུབ་ཕྱོགས་ལོགས་ན་ཉི་མའི་དཀྱིལ་འཁོར་ལྟར་སྣང་བ་ཞིག་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ནུབ་ཕྱོགས་ལོགས་ན་འབར་ཞིང་སྣང་བ་ཞུགས་ཀྱི་འོད་ཟེར་ལྟ་བུར་གདའ་བ་འདི་ཅི་ལགས།
en: Just then Venerable Ānanda saw a light in the west like the disk of the sun, and when he saw it, he asked the Blessed One, “Blessed One, what is that, blazing in the west and casting a glow like the light of a fire?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་འདི་ནི་དྲི་ནག་མའི་བུ་དྲང་སྲོང་འཇིག་རྟེན་པའི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དྲང་སྲོང་རྣམས་ཀྱི་མཆོག་དྲང་སྲོང་རྒྱས་པ་ཞེས་བྱ་སྟེ།
en: The Blessed One answered, “Ānanda, that is the seer Vyāsa, known as Kṛṣṇagandhavatīputra, who is the highest among the seers and possesses the five worldly clairvoyances.

source: དྲང་སྲོང་དཀའ་ཐུབ་དྲག་པོ་ལ་གནས་པ།
en: He is a seer who adheres to severe ascetic practice.

source: བསྙེན་པར་གནས་པ་བརྒྱ་སྟོང་གིས་དུབ་པ།
en: He is emaciated because he has performed hundreds of thousands of ritual services.

source: ལུས་ཀྱི་མཛེས་པ་མེད་པ་ལྔ་བརྒྱ་ཙམ་ཕྱི་བཞིན་དུ་འབྲང་བ་ལ་དྲང་སྲོང་དཀར་མིན་གཞོན་ནུ་དང་། མི་ལྷ་དང་། རྣམ་པར་བདེ་སྲུང་གི་བུ་དང་། རི་དགས་མོའི་བུ་དང་། སྒྲ་བྱེད་ཀྱི་བུ་དང་། ཕུར་བུ་རྣ་དང་། མེའི་བུ་དང་། རྣམ་པར་རྐོའི་བུ་དང་། བསྙེན་པར་དཀའ་དང་། དེ་དག་ལ་སོགས་པས་ཡོངས་སུ་བསྐོར་ནས་རྗེས་སུ་འཆག་པའོ། །
en: He is followed by a retinue of about five hundred people with unpleasant appearances, including the seers Young Asita, Human-God, Son of Pleasure Protector, Son of a Doe, Son of the Grammar Author, Nose of Bṛhaspati, Son of Fire, Son of an Engraver, and Durāsada.”

source: དེ་ནས་དེའི་བར་སྐབས་སུ་རྒྱས་པས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་དབང་པོ་ཞིབ། ཐུགས་ཞིབ། བསམ་གཏན་གྱི་དབེན་པ་ལ་དགྱེས་པ། ཤིང་ལྗོན་པ་སྟུག་པོའི་ནང་ན་བཞུགས་པ་མཐོང་ངོ་།
en: Vyāsa saw the Blessed One dwelling among those thick trees surrounded by a retinue of monks and delighting in meditative concentration with his senses and mind pacified.

source: །མཐོང་ནས་ཀྱང་རྒྱས་པ་འདི་སྙམ་དུ་སེམས་ཏེ། ཀྱེ་མའོ་མ་ལ་ངོ་མཚར་ཏེ།
en: When Vyāsa saw him, he thought, “Oh, how wonderful!

source: འདི་བཅོམ་ལྡན་འདས་ཐམས་ཅད་མཁྱེན་པ་ཕྱིན་ཅི་མ་ལོག་པ་གསུང་བ་ཞེས་འཇིག་རྟེན་དུ་གྲགས་པ་ནི་གནས་ཡིན་ནོ།
en: The one renowned the world over as the blessed omniscient one who teaches without error is sitting over there.

source: །ཇི་ལྟར་འདི་ཁ་དོག་རྒྱས་པ་མཆོག་དང་ལྡན་ཞིང་རྨད་དུ་བྱུང་བའི་གཟུགས་རྒྱ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ་ལས་ན་འདི་གདོན་མི་ཟ་བར་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ།
en: Since he has such an exceedingly fine complexion and such an expansive body, and since his actions are so fortuitous, he is most certainly the Tathāgata.

source: །འདི་ལྟར་བཅོམ་ལྡན་འདས་གཟུགས་རྒྱ་ཆེན་པོ་འདི་ལྟ་བུ་དང་ལྡན་པས་འཁོར་ལོས་སྒྱུར་བའི་དབང་ཕྱུག་གི་བདག་པོ་དུག་དང་བཅས་པ་བཞིན་དུ་སྤངས་ཏེ། བུད་མེད་རིན་པོ་ཆེ་ས་འཚོ་མ་ལ་སོགས་པ་བུད་མེད་དྲུག་སྟོང་ཡང་སྤངས་ནས་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་གྱི་ནང་དུ་གཤེགས་ཏེ་བཞུགས་པ་འདི་ནི་ཀྱེ་མའོ་འཇིག་རྟེན་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའོ་སྙམ་དུ་སེམས་སོ།
en: This Blessed One who possesses such an expansive form renounced being a sovereign lord of universal emperors as if it were poisonous, renounced precious Gopā and six thousand women, and went to live in a forest grove where austerities are practiced. What a marvel he is in the world!”

source: །དེ་ནས་དྲང་སྲོང་མེས་སྦྱིན་གྱི་བུས་ཀྱང་རྒྱང་རིང་པོ་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ། དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་དོ། །ཤིང་སྔོན་དག་གི་ཁྲོད་འདུག་ཅིང་། །བཙོ་མའི་གསེར་ལྟར་སེར་བར་སྣང་།
en: Then the seer Agnidattaputra also saw the Blessed One from afar, and it led him to feel so content, happy, and pleased that he praised the Blessed One with the following verses, which reflected his own pleasant frame of mind: “He sits amid a green grove Shining yellow like refined gold.

source: །གཟུགས་ནི་ཤིན་ཏུ་འབར་བས་ན། །སྐྱེ་བོ་ཀུན་གྱི་དགའ་བ་སྐྱེད།
en: Glowing brilliantly, his body Delights all living beings. “

source: །བཻདཱུརྱ་ནི་དྲི་མེད་བྲག །སྟུག་ནང་རི་རབ་རྩེ་གཅིག་འཕགས། །
en: He rises like the peak of Sumeru Among a thicket of pure beryl cliffs.

source: སྟོན་གྱི་ཉི་མ་རབ་ལྷན་ལྟར། །དཔལ་གཟུགས་འབར་བ་འདི་སུ་ཞིག །
en: Who is this one whose majestic glowing body Shines like the autumn sun?”

source: དེ་ནས་དྲང་སྲོང་ཆེན་པོ་དེ་དག་ཐམས་ཅད་དགའ་སྟེ་མིག་ཕྱེ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ངོ་།
en: The great seers were all delighted, and with their eyes open and palms together they went to where the Blessed One was.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་འཛམ་བུའི་གླིང་པའི་དྲང་སྲོང་མེའི་ཕུང་པོ་ལྟར་འབར་བ། རལ་པའི་ཅོད་པན་ཅན། རྒས་པ། རབ་ཏུ་རྐེ་བ།
en: Then the Blessed One told his monks, “Monks, look at the seers of Jambudvīpa, blazing like bonfires—they have topknots of matted hair, and they are aged and very thin.

source: ཟས་མི་ཟ་ཞིང་བསྙེན་པར་གནས་པ། ཤིང་ཤུན་དང་། གཡང་གཞི་གྱོན་པ། ཐལ་བས་བྱུགས་པ། ཐང་དང་བྲག་ཁྲོད་ན་གནས་པ། བཀྲེས་བཀྲེས་ལྟར་འདུག་པ། རླུང་འགམ་པ། ཟླ་བ་ཕྱེད་བསྙེན་གནས་བྱས་པ།
en: They do things such as not eating, performing ritual services, wearing tree bark and whole animal skins, rubbing themselves with ash, dwelling on plains and amid rocky crags, living in great hunger, consuming only air, and observing ritual fasts for half of the month.

source: ཡན་ལག་སྐེམ་པ། གཅེར་བུ་པ་ཤིང་ཤུན་གྱོན་པ། ཨག་ཚོམ་དང་། སེན་མོ་དང་། སྤུ་རིང་བ། བུང་བའི་ཁ་དོག་ལྟ་བུ།
en: Their bodies are emaciated, they are naked or wear bark, their beards, fingernails, and hair are long, they have the complexion of a bee, and they have a wealth of ascetic heat.

source: དཀའ་ཐུབ་ཀྱི་ནོར་ཅན། བཟླས་བརྗོད་དང་། སྦྱིན་སྲེག་དང་། བསྲུང་བ་དང་། བཀྲ་ཤིས་པ་བྱས་པ།
en: They practice recitation, fire offerings, protective rites, and auspicious ceremonies.

source: ས་དང་། བླ་གབ་མེད་པ་དང་། ཤིང་དྲུང་ན་གནས་པ། རྐང་པ་གྱེན་དུ་སྒྲེང་བ།
en: They dwell in the dirt, in the open, and at the feet of trees.

source: ཅོག་ཅོག་པོར་འདུག་པ། ཆུའི་ནང་དུ་འཇུག་པ། མེ་མདག་འབར་བ་དང་། སྲེག་མེ་རབ་ཏུ་འབར་བ་དང་། ཉི་མས་ལུས་ཤིན་ཏུ་གདུངས་པ།
en: They hold their legs aloft, they sit in an upright squatting posture, they stand in water, and they burn their bodies with burning hot coals, blazing fire, and the sun.

source: དཀའ་ཐུབ་དྲག་པོས་ཡོངས་སུ་བསྐོར་བ། བབ་བབ་ཏུ་གནས་པ། རིགས་ཙམ་གྱིས་ཡོངས་སུ་དགའ་བ། བླ་ན་མེད་པའི་ཡེ་ཤེས་དང་བྲལ་བ་དེ་དག་ལ་ལྟོས།
en: They surround themselves with practitioners of severe austerities, they live carelessly, they delight in merely being from their clan, and they lack the highest wisdom. “

source: དགེ་སློང་དག་དྲང་སྲོང་ཆེན་པོ་འདི་དག་ནི་འཁོར་བ་ལས་འབྱུང་བ་མི་ཤེས་པ་དག་སྟེ།
en: Monks, these great seers do not know how to get out of saṃsāra.

source: འདི་དག་ནི་འདོད་པ་དང་རྒྱགས་པས་མྱོས་པ། ཡང་སྲིད་པར་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པ། ལྟ་བའི་རྒྱུ་བ་ཡོངས་སུ་མ་དག་པ་ཤ་སྟག་གོ །
en: They are mad with desire and self-satisfaction, they cling to their next rebirth, and the conduct related to their false views is utterly incorrect.”

source: དེ་ནས་དགེ་སློང་དེ་དག་བཅོམ་ལྡན་འདས་ལ་སེམས་ཐག་པ་ནས་སྐྱབས་སུ་དོང་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་ཚངས་པར་སྤྱོད་པའི་ཚོགས་སྒྲུབ་པ་སྟེ། དེའི་སླད་དུ་བདག་ཅག་སྲིད་པར་སྐྱེ་བ་མི་འཛིན་ཏོ།
en: The monks took refuge in the Buddha from the core of their hearts and said, “Blessed One, we practice the entire host of vows of pure conduct so that we will not take rebirth within existence.”

source: །དེ་ནས་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པས་དྲང་སྲོང་ཆེན་པོ་དེ་དག་གི་སེམས་དང་མི་འཇིགས་པ་དམན་ཞིང་ལྟ་བ་དམན་པར་ཁད་ཀྱིས་ཁད་ཀྱིས་བརྟགས་ནས་གུས་པ་སྐྱེས་ཏེ། རྗེས་དང་བཅས་པར་དྲང་སྲོང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ནས་རལ་པ་མང་པོ་བརྫེས་ཏེ། མཆོད་ཕྱིར་ཐོགས་ཐོགས་པ། སྔོ་སངས་པོ། མིག་གཉིས་སེར་བ། སྐྲ་རྩུབ་ཅིང་གྲུགས་པ། ལག་ན་དབྱུག་གུ་གསུམ་ཐོགས་པ། གཟུགས་རབ་ཏུ་མི་སྡུག་པ་དང་ལྡན་པ། ནམ་མཁའི་ངོས་ལས་འགྲོ་བ། གཏམ་སྣ་ཚོགས་ཀྱི་གཏན་ཚིགས་དང་ལྡན་པ་དེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The great seer Vyāsa privately reflected on the fact that great seers are inferior in terms of their intention and fearlessness and inferior in terms of their view, and respect for the Buddha and his monks arose in him. Surrounded by that group of seers who revered him, and adorned with his many locks of matted hair, a sacred thread emblazoned across his dark skin, with two yellow eyes, his hair wild and hanging down, holding a trident in his hand, and having an unattractive appearance, he who coursed in the vault of the heavens and had mastered the logical arguments of various systems went to where the Blessed One was and said,

source: །འཁོར་འདི་ནི་ཀུན་ཏུ་རྨོངས་པ་སྟེ། འདི་ན་གནས་ལགས་ན་བདག་འདིར་མཆིས་པར་བཅོམ་ལྡན་འདས་མཁྱེན་པར་མཛད་དུ་གསོལ།
en: “This group is completely deluded. May the Blessed One please perceive how I came to where I am here?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དྲང་སྲོང་ཆེན་པོ་སྲིད་པར་སྐྱེ་བ་ཐམས་ཅད་ཀྱང་ངས་ཤེས་ཏེ་དངོས་པོ་དེ་ཡང་རིག་གོ །
en: The Blessed One replied, “Great Seer, since I perceive all those who take birth in existence, that is a matter I do indeed know about.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དྲང་སྲོང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་གསལ་བ་ཟུར་ཕྱིན་པ། ཞིབ་པ་མཁས་པ། བློ་དང་། ཤེས་པ་དང་། མི་འཇིགས་པ་དང་། རལ་པའི་ཟར་བུའི་ཅོད་པན་ཅན་འདི་སུ་ལགས།
en: Venerable Ānanda asked the Blessed One, “Blessed One, who is this person with a crown of matted locks who is surrounded by a group of seers and so radiant, brilliant, peaceful, wise, intelligent, knowledgeable, and fearless?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་འདི་ནི་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པ་ཞེས་བྱ་སྟེ།
en: Ānanda,” the Blessed One replied, “this is the great seer Vyāsa.

source: རིག་བྱེད་རྣམས་བྱེད་པ། ནུས་ཅན་བུའི་བསྟན་བཅོས་ཀྱིས་འཚོ་བ། ཡི་གེ་སྣ་ཚོགས་སྡུད་པའོ།
en: He practices the Vedic rites, lives according to the Brahmanical treatises, and has compiled numerous texts.”

source: །དེ་ནས་དགྲ་བཅོམ་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་རྒྱས་པ་མཐོང་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ནི་འཁོར་བའི་སྡུག་བསྔལ་ལས་ཡོངས་སུ་མ་གྲོལ་བ་ལགས་ན། དཀའ་ཐུབ་དྲག་པོས་ཡོངས་སུ་ཉོན་མོངས་པ་རྙེད་པ་འདིས་ཅི་ཞིག་ཐོབ།
en: When the arhats saw Vyāsa they asked, “Blessed One, of what use are severe ascetic practices that cause such hardship if they cannot liberate one from cyclic existence?”

source: དགྲ་བཅོམ་པ་དེ་དག་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། རྒྱས་པ་འདིས་བཅོམ་ལྡན་འདས་ལ་གཏམ་གང་བདག་མེད་པའི་གཏམ་འམ། སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་རབ་ཏུ་ལྡན་པའི་གཏམ་འམ། ཅིའི་རྒྱུ་དང་རྐྱེན་གྱི་གཏམ་ཞིག་ཞུ་སྙམ་མོ།
en: And those arhats thought that Vyāsa should ask the Blessed One for a teaching about no-self, a teaching about generosity and having moral conduct, or some kind of teaching about causes and conditions.

source: །དེ་ནས་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འབྱུང་བ་དང་། ད་ལྟར་དྲང་སྲོང་ཆེན་པོ་ཚོགས་པ་འདི་ཤིན་ཏུ་རྙེད་པར་དཀའ་བ་ལགས་སོ།
en: Then the seer Vyāsa said to the Blessed One, “Blessed One, this present meeting of the great seers is an extremely rare event.

source: །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ།
en: If the Blessed One would be so kind as to give me the opportunity to ask a few questions so that he might give a teaching, I would like to ask the blessed, thus-gone, worthy, perfect Buddha about a few matters.” “

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དྲང་སྲོང་ཆེན་པོ་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་།
en: Great Seer,” the Blessed One replied to the seer Vyāsa, “ask whatever you like.

source: དྲིས་པ་དེ་དང་དེ་དེ་ལྟ་དེ་ལྟར་ལུང་བསྟན་པར་བྱའོ།
en: I shall answer your questions accordingly.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་སྦྱིན་པ་སྦྱིན་པར་བགྱི།
en: Then the seer Vyāsa asked the Blessed One, “Blessed One, how should one give a gift?

source: སྦྱིན་པ་མ་ལགས་པའི་དོན་གང་ལགས།
en: What does it mean to not give a gift?

source: སྦྱིན་པ་ཞེས་བགྱི་བའི་དོན་གང་ལགས།
en: What is the meaning of what is called giving?

source: སྦྱིན་བདག་ཇི་ལྟར་རབ་ཏུ་འཚལ་བར་བགྱི།
en: How should one seek out a donor?

source: ཇི་ལྟར་ན་གཏོང་བ་པོར་འགྱུར།
en: How can one become someone who has given up material things?

source: ཇི་ལྟར་ན་སྦྱིན་བདག་ལགས་ལ་གཏོང་བ་པོ་མ་ལགས།
en: How can one be a donor but not someone who has given up material things?

source: ཇི་ལྟར་ན་སྦྱིན་བདག་སྦྱིན་པའི་མཐར་འགྲོ་བ་ཞེས་བགྱི།
en: How is a donor said to have reached the limit of giving?

source: སྤུངས་པར་གནས་པ་འམ། བརྩེགས་པར་གནས་པ་འམ།
en: Are those gifts heaped up or piled up?

source: ཇི་ལྟར་བལྟ་བར་བགྱི།
en: How should we look after them?

source: ཇི་ལྟར་ན་སྦྱིན་བདག་ལེན་པ་ལ་མི་གནས་པར་སྦྱིན་པ་སྦྱིན་པ་ལགས།
en: How can a donor give a gift to someone who does not receive it?

source: སྦྱིན་པའི་རྣམ་པར་སྨིན་པ་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: How should one view the karmic fruition of a gift?

source: ཇི་ལྟར་ན་བཅོམ་ལྡན་འདས་མྱ་ངན་ལས་འདས་པའི་མཆོད་རྟེན་ལ་མཆོད་པ་ལགས།
en: How should we make offerings to stūpas following the Blessed One’s nirvāṇa?

source: བསོད་ནམས་དེའི་རྣམ་པར་སྨིན་པ་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: How should we view the fruition of that merit?

source: བཅོམ་ལྡན་འདས་ཁྱོད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་གང་ལགས།
en: Blessed One, what gifts can you accept after your parinirvāṇa?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དྲང་སྲོང་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པའི་གཏམ་ཁྱོད་ཀྱིས་དྲིས་པ་འདི་ནི་རྩིང་ངོ་།
en: The Blessed One said to the great seer Vyāsa, “Great Seer, the questions you have asked concern generating the initial thought of awakening and indicate that you are magnanimous.”

source: །དེ་ན་གནས་བརྟན་ཤ་ར་དྭ་ཏིའི་བུ་སྨིན་མ་རིང་བ། གཉེར་མ་ཅན། མགོ་སྐྱ་བོས་ལག་པ་གཡས་པས་སྨིན་མ་གཟར་ནས་མིག་ལྤགས་བཏེགས་ཏེ་བལྟས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དྲང་སྲོང་ཆེན་པོ་རྒྱས་པ་འདི་འཇིག་རྟེན་ན་གྲགས་པ་ཡིན་ན་གཏན་ཚིགས་ཀྱི་རིག་པ་མི་ཤེས་པའི་བྱིས་པ་རོགས་རྒོད་ལྟ་བུར་མཁས་པའི་བློ་མེད་དེ།
en: At that point the elder Śāriputra looked at him with his long eyebrows, wrinkles, and white hair, his left hand placed on his brow to lift his eyelids so that he could see, and said, “This great seer Vyāsa, who is so renowned in the world, is like a wild young child who does not understand the science of reasoning and lacks a well-trained intellect.

source: རྒྱུ་དང་རྐྱེན་གྱི་གཏམ་སྤངས་ཤིང་བདག་མེད་པའི་གཏམ་བོར་ལ་ལྷ་ཡུལ་བའི་རྒྱུའི་གཏམ་བཏང་སྟེ། ཅིའི་ཕྱིར་སྦྱིན་པའི་གཏམ་ཉིད་ཞུས་པར་གྱུར།
en: He has abandoned the teaching on causes and conditions, forsaken the teaching on no-self, and cast aside the teaching on the causes that lead to the god realms, so why is he requesting this teaching on giving?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་དྲང་སྲོང་ཆེན་པོ་འདི་ལ་སྦྱིན་པའི་འབྲས་བུ་སྦྱིན་པའི་བཀའ་མཆིད་བགྱིའོ།
en: Then the elder Ānanda prostrated at the Blessed One’s feet and said, “Blessed One, please allow me to explain giving and the result of giving to this great seer.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་ལ་དྲིས་ལ། ཉན་ཐོས་ཀྱིས་བཤད་པ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཚུལ་མ་ཡིན་ཏེ་མི་དགོས་ཀྱིས། ཀུན་དགའ་བོ་དེ་སྐད་མ་ཟེར་ཅིག་འདི་ནི་གནས་མ་ཡིན་ནོ།
en: Ānanda,” the Blessed One replied, “it is not the Tathāgata’s custom, nor is it necessary, to allow a śrāvaka to respond to a question posed to the Tathāgata, so do not speak, Ānanda, for it is not fitting.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པ་ཅི་དང་ཅི་འཚལ་བ་དྲིས་པའི་ལན་གདབ་པར་བགྱིའོ།
en: The elder Śāriputra then said to the Blessed One, “Blessed One, please allow me to provide the answers that the great seer Vyāsa seeks.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཁྱོད་ཀྱང་དེ་སྐད་མི་འཚམ་པར་མ་ཟེར།
en: The Blessed One said, “Śāriputra, you should also not say such unsuitable things.

source: ངའི་མདུན་ན་ཉན་ཐོས་ཀྱིས་ཐེ་ཚོམ་བཅད་པ་འདི་ནི་མི་རིགས་ཏེ། ང་ལ་སེམས་ཅན་གྱི་སེམས་མ་རངས་པར་འགྱུར་རོ། །སེམས་མ་རངས་ནས་འདི་སྐད་དུ་གང་གི་ཕྱིར་རྒྱས་པས་དྲིས་ཉན་ཐོས་འཆད་དུ་བཅུག་པ་ལས་ན་དེ་བཞིན་གཤེགས་པ་ནི་ཐམས་ཅད་མཁྱེན་པ་མ་ཡིན་དུ་ངེས་སོ།
en: It is not right for a śrāvaka to clarify doubts in my presence, because it will lead beings to become displeased with me, and that displeasure would lead them to wonder why the Tathāgata had a śrāvaka answer Vyāsa’s questions.

source: །ཡང་ན་ནི་སངས་རྒྱས་ལ་ངར་འཛིན་པ་ཡོད་དོ་ཞེས་ཟེར་བར་འགྱུར་ཏེ། སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་འགྱུར་རོ།
en: As a result, they will say that the Tathāgata is certainly not omniscient or that the Buddha possesses attachment to self, and that will lead those beings to be born in the hell realms.”

source: །དེ་ནས་དགེ་སློང་དེ་དག་བཅོམ་ལྡན་འདས་ལ་དགའ་བ་སྐྱེས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པའི་ཐེ་ཚོམ་བསལ་བའི་སླད་དུ་བཤད་དུ་གསོལ།
en: All the monks felt a sense of joy toward the Blessed One and said, “Blessed One, please teach so that you might remove the great seer Vyāsa’s doubts.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཆེན་པོ་རྒྱས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དྲང་སྲོང་ཆེན་པོ་སྦྱིན་པའི་རྣམ་པར་སྨིན་པ་དང་། སྦྱིན་པའི་བྱ་བ་དང་། སྦྱིན་པའི་རྣམ་པར་དབྱེ་བ་དང་། སྦྱིན་པ་ཞེས་བྱ་བའི་དོན་གང་ཡིན་པ་དང་། སྦྱིན་བདག་གིས་ཡོངས་སུ་སྤྱད་ན་ཇི་ལྟར་སྦྱིན་པ་སྦྱོང་བ་དང་། དེ་དག་ལ་བྱིན་ན་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཇི་ལྟར་རབ་ཏུ་འཕེལ་བ་དེ་ཉོན་ཅིག་གང་གི་ཕྱིར་སྦྱིན་པ་ཞེས་བྱ་བ་དང་།
en: The Blessed One then said to the great seer Vyāsa, “Great Seer, listen as I shall explain the karmic fruition of giving, the act of giving, the types of giving, the meaning of the term giving, how to purify the gift when acting as a donor, and how the karmic fruition of merit increases when a gift is given. “

source: སྦྱིན་པ་ཞེས་བྱ་བའི་དོན་གང་ཡིན་ཞེས་བྱ་བ་ནི་དྲང་སྲོང་ཆེན་པོ་འདི་ལ་གཏོང་བ་པོས་སྦྱིན་པའི་དངོས་པོ་ཡོངས་སུ་གཏང་སྟེ།
en: As for why it is called giving and what that term giving means, Great Seer, someone who gives up material things completely relinquishes the things that are given as gifts.

source: དད་པ་བསྐྱེད་ནས་གཞན་བྱེད་དུ་བཅུག་སྟེ་ཡུལ་གཞན་དུ་སོང་ནས་བྱེད་དུ་བཅུག་པ་དེས་ཀྱང་ནོར་རྣམས་རྣམ་པར་གཏོང་བར་བྱེད་ན་ནོར་གང་གི་ཡིན་པ་དེ་ནི་སྦྱིན་བདག་ཡིན་ནོ།
en: They generate faith and inspire others to give. They travel to other lands and inspire others to give. And when they motivate someone to give things of value, the person to whom that valuable thing belonged is a donor.

source: །བྱེད་དུ་བཅུག་པས་བྱིན་པ་ནི་གཏོང་བ་པོ་ཡིན་གྱི་སྦྱིན་བདག་མ་ཡིན་ནོ།
en: Someone who has given by encouraging others to do so is someone who gives up material things, but they are not a donor.

source: །གང་རང་གི་དངོས་པོ་བདག་ཉིད་ཀྱིས་སྦྱིན་པ་དེ་ནི་གཏོང་བ་པོ་ཡང་ཡིན་ལ་སྦྱིན་བདག་ཀྱང་ཡིན་ནོ།
en: An individual who gives away their own material possessions is someone who has given up material things and they are also a donor. “

source: །དྲང་སྲོང་ཆེན་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་སྦྱིན་པ་ཡོངས་སུ་མ་དག་པར་བལྟའོ། །རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲང་སྲོང་ཆེན་པོ་འདི་ལ་གཏོང་བ་པོ་ཕྱིན་ཅི་ལོག་ཏུ་ལྟ་བར་གྱུར་ཅིང་མ་དད་པ་དང་མ་དང་བ་མང་ལ་དེས་སྦྱིན་པ་བྱིན་ན་དེའི་སྦྱིན་པ་དེ་ཡོངས་སུ་མ་དག་པ་ཡིན་ནོ།
en: Great Seer, you should view the following thirty-two ways of giving as being impure: “Great Seer, (1) if someone who has given up material things holds an incorrect view and gives a gift with a great deal of distrust and suspicion, that gift is impure. “

source: །དྲང་སྲོང་ཆེན་པོ་གཞན་ཡང་ཕན་བཏགས་པའི་ལན་དུ་ཕན་འདོགས་པར་བྱ་བའི་ཕྱིར་སྦྱིན་པ་བྱིན་ན་དེ་ཡོངས་སུ་མ་དག་པ་ཡིན་ནོ།
en: Moreover, Great Seer, (2) if a gift is given out of gratitude for a favor, it is impure. “

source: །དེས་དམན་པ་དང་། འདོད་པའི་རྒྱུའི་ཕྱིར་གང་འདི་ལྟ་བུའི་སེམས་ཀྱིས་མེ་ལ་སྦྱིན་པ་སྦྱིན་ནོ་ཞེ་འམ། མེ་ལྕེ་ལ་སྦྱིན་པ་སྦྱིན་ནོ་ཞེའམ། ཆུ་ལ་སྦྱིན་པ་སྦྱིན་ནོ་ཞེ་འམ། དེས་བདག་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་རྒྱལ་པོ་ལ་སྦྱིན་པ་བྱིན་ན་སྦྱིན་པ་དེ་ཡོངས་སུ་མ་དག་པ་ཡིན་ནོ།
en: When someone motivated by some inferior reason or desire says, (3) ‘I give this gift to the fire,’ (4) ‘I give this gift to the flames,’ or (5) ‘I give this gift to the waters,’ or (6) gives a gift to a king so that he will take notice of them, that gift is impure.

source: །གང་མི་འཇིགས་པའི་ཕྱིར་ཆོམ་པོ་ལ་སོགས་པ་ལ་སྦྱིན་པ་བྱིན་ཏེ།
en: “(7) If one gives a gift to thieves and the like because one is afraid of them, it is impure. “
